Repository: peterlee0127/DNS-Security-Pro-macOS
Catalog: DNSSecurityProMac/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hant

source: A focused, native SwiftUI app for switching system-wide encrypted DNS profiles on macOS. No Mac Catalyst or embedded iOS interface.
zh_hant: 專為 macOS 打造的原生 SwiftUI 加密 DNS 設定切換工具，不使用 Mac Catalyst，也不嵌入 iOS 介面。

source: A profile with the same name and protocol already exists.
zh_hant: 已有相同名稱與通訊協定的設定。

source: About
zh_hant: 關於

source: Add Profile
zh_hant: 新增設定

source: App Behavior
zh_hant: App 行為

source: Approval Required
zh_hant: 需要核准

source: Approve macOS
zh_hant: 核准 macOS

source: Automatic
zh_hant: 自動

source: Bootstrap Servers
zh_hant: Bootstrap 伺服器

source: Built-in
zh_hant: 內建

source: Built-in and custom DoH / DoT profiles
zh_hant: 內建與自訂 DoH / DoT 設定

source: Built-in Profile
zh_hant: 內建設定

source: Built-in Profiles
zh_hant: 內建設定

source: Built-in profiles cannot be edited or deleted.
zh_hant: 內建設定無法編輯或刪除。

source: Cancel
zh_hant: 取消

source: Checking DNS status…
zh_hant: 正在檢查 DNS 狀態…

source: Choose a built-in resolver on Dashboard, or add your own DoH or DoT profile in DNS Profiles.
zh_hant: 在「儀表板」選擇內建解析器，或在「DNS 設定檔」加入自己的 DoH 或 DoT 設定。

source: Choose a DNS profile
zh_hant: 選擇 DNS 設定

source: Choose a profile before connecting.
zh_hant: 連線前請先選擇一個設定。

source: Choose a profile from the list to view its settings.
zh_hant: 從清單選擇一個設定以查看詳細內容。

source: Choose a profile, connect, and approve the configuration the first time.
zh_hant: 選擇設定檔並連線，第一次使用時核准設定。

source: Choose a profile, then connect encrypted DNS.
zh_hant: 選擇設定檔，然後連線加密 DNS。

source: Choose Connect on Dashboard. DNS Security Pro installs the selected encrypted DNS configuration.
zh_hant: 在「儀表板」選擇「連線」，DNS Security Pro 會安裝選取的加密 DNS 設定。

source: Choose how the app stays available
zh_hant: 選擇 App 的常駐方式

source: Choose what DNS Security Pro does after you apply a DNS change.
zh_hant: 選擇套用 DNS 變更後 DNS Security Pro 的運作方式。

source: Closing DNS Security Pro does not disable an installed profile. Choose Disconnect on Dashboard when you want to return to the system DNS.
zh_hant: 關閉 DNS Security Pro 不會停用已安裝的設定。要恢復使用系統 DNS，請在「儀表板」選擇「中斷連線」。

source: Confirm protection
zh_hant: 確認保護狀態

source: Connect
zh_hant: 連線

source: Connect DNS
zh_hant: 連接 DNS

source: Connect encrypted DNS
zh_hant: 連接加密 DNS

source: Connect when you want to use this profile.
zh_hant: 要使用此設定時再連線。

source: Copy
zh_hant: 複製

source: Custom
zh_hant: 自訂

source: Custom Profiles
zh_hant: 自訂設定

source: Dashboard
zh_hant: 儀表板

source: Delete Profile
zh_hant: 刪除設定

source: Delete this DNS profile?
zh_hant: 要刪除此 DNS 設定嗎？

source: Details
zh_hant: 詳細資訊

source: Disconnect
zh_hant: 中斷連線

source: Disconnect DNS
zh_hant: 中斷 DNS

source: DNS Changes
zh_hant: DNS 變更

source: DNS Could Not Be Disabled
zh_hant: 無法停用 DNS

source: DNS Could Not Be Enabled
zh_hant: 無法啟用 DNS

source: DNS over HTTPS requires an https:// endpoint URL. Bootstrap servers are optional.
zh_hant: DNS over HTTPS 需要 https:// 端點網址；Bootstrap 伺服器可留空。

source: DNS over TLS requires a certificate server name and at least one bootstrap server.
zh_hant: DNS over TLS 需要憑證伺服器名稱及至少一個 Bootstrap 伺服器。

source: DNS over TLS requires at least one bootstrap server address.
zh_hant: DNS over TLS 至少需要一個 Bootstrap 伺服器位址。

source: DNS Profile
zh_hant: DNS 設定

source: DNS Profile Could Not Be Applied
zh_hant: 無法套用 DNS 設定

source: DNS Profiles
zh_hant: DNS 設定

source: DNS Status Error
zh_hant: DNS 狀態錯誤

source: DNS status is unavailable
zh_hant: 無法取得 DNS 狀態

source: Edit DNS Profile
zh_hant: 編輯 DNS 設定

source: Encrypted DNS for your Mac
zh_hant: 為 Mac 啟用加密 DNS

source: Encrypted DNS is active
zh_hant: 加密 DNS 已啟用

source: Encrypted DNS is off
zh_hant: 加密 DNS 已關閉

source: Endpoint
zh_hant: 端點

source: Enter a DNS endpoint.
zh_hant: 請輸入 DNS 端點。

source: Enter a profile name.
zh_hant: 請輸入設定名稱。

source: Enter a TLS server name without http:// or https://.
zh_hant: 請輸入不含 http:// 或 https:// 的 TLS 伺服器名稱。

source: Enter a valid HTTPS URL for DNS over HTTPS.
zh_hant: 請輸入有效的 DNS over HTTPS 網址。

source: Enter valid IPv4 or IPv6 addresses for bootstrap servers.
zh_hant: 請輸入有效的 IPv4 或 IPv6 位址作為 Bootstrap 伺服器。

source: Follow these five steps. You normally need to approve the configuration only the first time.
zh_hant: 依照以下五個步驟操作。通常只有第一次需要核准此設定。

source: General
zh_hant: 一般

source: Get the iPhone and iPad app
zh_hant: 取得 iPhone 與 iPad 版

source: Good to know
zh_hant: 小提醒

source: HTTPS Endpoint URL
zh_hant: HTTPS 端點網址

source: In System Settings, open Network → VPN & Filters → DNS Security Pro, then approve the DNS configuration.
zh_hant: 在「系統設定」中依序開啟「網路」→「VPN 與過濾條件」→「DNS Security Pro」，然後核准 DNS 設定。

source: Keep quick DNS controls available after closing the main window.
zh_hant: 關閉主視窗後，仍可從選單列快速控制 DNS。

source: Keep the menu bar control enabled, or hide it and optionally quit after successful DNS changes.
zh_hant: 保留選單列控制，或將它隱藏，並選擇是否在成功變更 DNS 後結束 App。

source: Learn about encrypted DNS
zh_hant: 瞭解加密 DNS

source: Local profile storage with no account required
zh_hant: 設定僅儲存在本機，無需帳號

source: Manage built-in profiles or edit your custom resolvers.
zh_hant: 管理內建設定或編輯自訂解析器。

source: Menu Bar
zh_hant: 選單列

source: Name
zh_hant: 名稱

source: Native macOS Edition
zh_hant: 原生 macOS 版

source: Native SwiftUI and AppKit lifecycle
zh_hant: 原生 SwiftUI 與 AppKit 生命週期

source: New DNS Profile
zh_hant: 新增 DNS 設定

source: No custom profiles yet.
zh_hant: 尚未建立自訂設定。

source: No DNS Profile Selected
zh_hant: 尚未選擇 DNS 設定

source: OK
zh_hant: 好

source: Open DNS Profiles and select a built-in resolver, or add your own DoH or DoT profile.
zh_hant: 開啟「DNS 設定」，選擇內建解析器，或加入自己的 DoH 或 DoT 設定。

source: Open DNS Security Pro
zh_hant: 開啟 DNS Security Pro

source: Open Network Settings
zh_hant: 開啟網路設定

source: Open System Settings → Network → VPN & Filters → DNS Security Pro, approve the configuration, then return and refresh the status.
zh_hant: 請前往「系統設定」→「網路」→「VPN 與過濾條件」→「DNS Security Pro」核准設定，返回後再重新整理狀態。

source: Private DNS on Wi-Fi, Ethernet, and every macOS network interface.
zh_hant: 在 Wi-Fi、乙太網路及所有 macOS 網路介面使用私密 DNS。

source: Profile
zh_hant: 設定

source: Profile Could Not Be Saved
zh_hant: 無法儲存設定

source: Profile Details
zh_hant: 設定詳細資訊

source: Profiles Could Not Be Loaded
zh_hant: 無法載入設定

source: Profiles Could Not Be Saved
zh_hant: 無法儲存設定

source: Protocol
zh_hant: 通訊協定

source: Quit after applying DNS changes
zh_hant: 套用 DNS 變更後結束 App

source: Quit DNS Security Pro
zh_hant: 結束 DNS Security Pro

source: Reading the current macOS DNS configuration.
zh_hant: 正在讀取目前的 macOS DNS 設定。

source: Refresh DNS Status
zh_hant: 重新整理 DNS 狀態

source: Refresh DNS status if needed. A green shield and “Encrypted DNS is active” confirm that the profile is enabled.
zh_hant: 如有需要，請重新整理 DNS 狀態。綠色盾牌及「加密 DNS 已啟用」代表設定已生效。

source: Refresh to read the current macOS DNS configuration again.
zh_hant: 請重新整理，以再次讀取目前的 macOS DNS 設定。

source: Resolver
zh_hant: 解析器

source: Return to Dashboard and choose Connect. DNS Security Pro installs the selected encrypted DNS configuration.
zh_hant: 返回「儀表板」並選擇「連線」。DNS Security Pro 會安裝選取的加密 DNS 設定。

source: Revert Changes
zh_hant: 還原變更

source: Save
zh_hant: 儲存

source: Save & Use Profile
zh_hant: 儲存並使用設定

source: Save Changes
zh_hant: 儲存變更

source: Select a DNS profile
zh_hant: 選擇 DNS 設定

source: Selected
zh_hant: 已選取

source: Selected Profile
zh_hant: 選取的設定

source: Separate multiple IPv4 or IPv6 addresses with commas.
zh_hant: 多個 IPv4 或 IPv6 位址請以逗號分隔。

source: Set Up Encrypted DNS
zh_hant: 設定加密 DNS

source: Settings
zh_hant: 設定

source: Settings…
zh_hant: 設定…

source: Show DNS Security Pro in the menu bar
zh_hant: 在選單列顯示 DNS Security Pro

source: Switch DNS Profile
zh_hant: 切換 DNS 設定

source: System approval is required to connect.
zh_hant: 需要系統核准才能連線。

source: System approval may be required the first time you connect.
zh_hant: 第一次連線時可能需要系統核准。

source: System DNS configuration through NetworkExtension
zh_hant: 透過 NetworkExtension 設定系統 DNS

source: System Settings → Network → VPN & Filters → DNS Security Pro
zh_hant: 系統設定 → 網路 → VPN 與過濾條件 → DNS Security Pro

source: The installed DNS profile remains active after the app quits.
zh_hant: App 結束後，已安裝的 DNS 設定仍會保持啟用。

source: This built-in profile is read-only.
zh_hant: 此內建設定為唯讀。

source: TLS Server Name
zh_hant: TLS 伺服器名稱

source: Try Again
zh_hant: 再試一次

source: Tutorial
zh_hant: 教學

source: Use This Profile
zh_hant: 使用此設定

source: Version %@ (%@)
zh_hant: 版本 %@（%@）

source: You can always reopen the app to change or disable the installed profile.
zh_hant: 您隨時可以重新開啟 App，以變更或停用已安裝的設定。

source: Your Mac is protected by the selected encrypted DNS profile.
zh_hant: 此 Mac 正受到所選加密 DNS 設定的保護。
